>>> name = "ci"
>>> name
'ci'
>>> name = name + "f"
>>> id(name)
2435365484672
>>> id(name + "f")
2435365558064
>>> id(123456789)
2435365999664
>>> 123456789==123456789
True
>>> 123456789 is 123456789
True
>>> a=123456789
>>> b=123456789
>>> id(a)
2435365999632
>>> id(b)
2435365999696
>>> a == b
True
>>> a is b
False
>>> a= [1,2,3,4]
>>> a
[1, 2, 3, 4]
>>> type(a)
<class 'list'>
>>> a[0]
1
>>> a=[1,"a",[3,4],5,6]
>>> type(a)
<class 'list'>
>>> a[2]
[3, 4]
#파이썬안에서 만들어진 자료의 통신 == 객체 
>>> for i in range(5):
	print(i)

	
0
1
2
3
4

>>> for i in range(2,5):
	print(i)

	
2
3
4

>>> for i in range(2,5,2):
	print(i)

	
2
4

>>> print("%c"%(65)) #아스키코드로 이용하기.
A
>>> print("%s"%(65)) #string으로 사용하면 안된다.
65

#=============================================================================
>>> a="이름은 %s,나이는 %d"
>>> a
'이름은 %s,나이는 %d'
>>> a%("홍길동",300)
'이름은 홍길동,나이는 300'
>>> print("|%10s|",34)
|%10s| 34
>>> print("|%10s|"%(34))
|        34|
>>> print("|%010s|"%(34))
|        34|
>>> print("|%010d|"%(34))
|0000000034|
>>> print("|%-10s|"%(34))
|34        |
>>> print("|%10f|"%(34))
| 34.000000|
>>> print("|%-10f|"%(34))
|34.000000 |
>>> print("|%-10.1f|"%(34))
|34.0      |
>>> print("|%.1f|"%(34))
|34.0|
>>> print("|%10x|"%(34))
|        22|
>>> print("|%10o|"%(34))
|        42|
>>> oct(34)
'0o42'
>>> hex(34)
'0x22'
>>> bin(34)
'0b100010'
>>> hex(0o42)
'0x22'

>>> a=10
>>> if(a==10):
	print("a is 10")
else:
    print("a is not 10")
	
a is 10

#==============================================================================
i = int(input())

if(i==5):
    print("i is 5")
else:
    print("i is not 5")
    
================== RESTART: D:/평일_파이썬_신윤규/day05/day05_ex.py ==================
5
i is 5
>>> 
================== RESTART: D:/평일_파이썬_신윤규/day05/day05_ex.py ==================
4
i is not 5
#==============================================================================

for i in range(5):
    j = int(input())
    if(j==5):
        print("j is 5")
    else:
        print("j is not 5")


#==============================================================================
for j in range(5):
    i = int(input("%d번째 숫자를 입력하세요~!!!"%(int(j)+1)))
    if(i==5):
        print("%s입니다."%(i))
    elif(i==12):
        print("5는 아니지만 %s입니다."%(i))
    else:
        print("5는 아니지만 %s 입니다."%(i))

================== RESTART: D:/평일_파이썬_신윤규/day05/day05_ex.py ==================
1번째 숫자를 입력하세요~!!!2
5는 아니지만 2 입니다.
2번째 숫자를 입력하세요~!!!5
5입니다.
3번째 숫자를 입력하세요~!!!7
5는 아니지만 7 입니다.
4번째 숫자를 입력하세요~!!!8
5는 아니지만 8 입니다.
5번째 숫자를 입력하세요~!!!9
5는 아니지만 9 입니다.

#===============================================================================
for i in range(5):
    if(i%4==0):
        print("  *")
    elif(i%4==1 or i%4==3):
        print(" ***")
    elif(i%4==2):
        print("*****")
================== RESTART: D:/평일_파이썬_신윤규/day05/day05_ex.py ==================
  *
 ***
*****
 ***
  *

#================================================================================
n=5
for i in range(n):
    if(i<(n//2+0.5)):
        for j in range(n//2 - i):
            print(" ",end='')
        for k in range(i*2+1):
            print("*",end='')
    else:
        for j in range(i-n//2):
            print(" ",end='')
        for k in range(n-(i-n//2)*2):
            print("*",end='')
    print("")

================== RESTART: D:/평일_파이썬_신윤규/day05/day05_ex.py ==================
  *
 ***
*****
 ***
  *

#===============================================================================
>>> len([1,2,3])
3

ls=[1,2,3,5,6,7,9]
l = len(ls)         #배열의 길이
for i in range(l-1):        #0부터 n-1까지 선택
    for j in range(i+1,l): #선택한 것 뒤 부터, 끝까지 비교
        if  ls[i]>ls[j] :   #선택한것이 더크면
            tmp=ls[i]     #작은 값이 앞으로 간다.
            ls[i]=ls[j]
            ls[j]=tmp

print(ls)

================== RESTART: D:/평일_파이썬_신윤규/day05/day05_ex.py ==================
[1, 2, 3, 5, 6, 7, 9]
>>> 1,2,3,4
(1, 2, 3, 4)
>>> (a,b) = (1,2)

#==============================================================================
>>> even = 0
>>> odd = 0
>>> i=1
>>> while(i<=10):
	if(i%2==0):
		even+=i
		print(i,"is even")
	else:
		odd += i
		print(i,"is odd")
	i+=1

	
1 is odd
2 is even
3 is odd
4 is even
5 is odd
6 is even
7 is odd
8 is even
9 is odd
10 is even

#=============================================================================
>>> for i in range(100):
	print(i)
	if(i==4):
		break

	
0
1
2
3
4

#===============================================================================
>>> for i in range(10):
	if(i==4):
		continue
	print(i)

	
0
1
2
3
5
6
7
8
9

#===============================================================================
ls=[1,54,67,24,23,43,32,34,3,4,5]

data = int(input("찾을 수 를 찾으시오"))

j = 0
for i in ls:
    if(i==data):
        break;
    j+=1

while(j != len(ls)):
    if(ls[j] == data):
        print(j)
        break;
    j+=1
else:
    print("Not found")

if(j>=len(ls)):
    print("NOT FOUND")

================== RESTART: D:/평일_파이썬_신윤규/day05/day05_ex.py ==================
찾을 수 를 찾으시오20
Not found
NOT FOUND

찾을 수 를 찾으시오5
10

#===============================================================================

for i in range(1,6):
    if(i==3):
        continue
        print("3출")
    else:
        print(i,"출력~!!!")

print("다음문장")
================== RESTART: D:/평일_파이썬_신윤규/day05/day05_ex.py ==================
1 출력~!!!
2 출력~!!!
4 출력~!!!
5 출력~!!!
다음문장

#==============================================================================
stu_i=[]

while(True):
    print("1. 학생등록 \n2.학생 점수 등록\n3.학생 정보출력\n4.학생순위순 표기\n5.종료")
    sel = int(input())
    if(sel==1):
        name = input("학생의 이름을 등록하세요~!!!")
        age = input("학생의 나이를 입력하세요~!!!")
        stu_i.append([name,age,0])
    elif(sel==2):
        score = int(input("점수를 등록하세요~!!!"))
    elif(sel==3):
        n= int(input("확인하고자 하는 학생 번호 입력:"))
        print("%s번 학생 | 이름 : %s |나이: %s|점수: %s"%(n.stu_i[n][0],n.stu_i[n][1],n.stu_i[n][2]))
    elif(sel==4):
        print("학생 순위순 표기")
    else:
        break;
================== RESTART: D:/평일_파이썬_신윤규/day05/day05_ex.py ==================    
1. 학생등록 
2.학생 점수 등록
3.학생 정보출력
4.학생순위순 표기
5.종료
1
학생의 이름을 등록하세요~!!!홍길동
학생의 나이를 입력하세요~!!!20
1. 학생등록 
2.학생 점수 등록
3.학생 정보출력
4.학생순위순 표기
5.종료
2
점수를 등록하세요~!!!95
1. 학생등록 
2.학생 점수 등록
3.학생 정보출력
4.학생순위순 표기
5.종료
3
확인하고자 하는 학생 번호 입력:1
1번 학생 | 이름 : 홍길동 |나이: 20|점수: 95
1. 학생등록 
2.학생 점수 등록
3.학생 정보출력
4.학생순위순 표기
5.종료
5

#==============================================================================
>>> test_i=[1,[2,3],"sdaf",print] #특별한 케이스 
>>> test_i[3]("asadf")
asadf
>>> test_i[1].append(4)
>>> test_i
[1, [2, 3, 4], 'sdaf', <built-in function print>]
>>> test_i[2][:1]
's'

>>> test = [[1,2],[3,4],[5,6]]
>>> test2 = test
>>> test2[0]
[1, 2]
>>> test[1][1]
4
>>> test[1][1]
4
>>> test2[1][1]=5
>>> test2
[[1, 2], [3, 5], [5, 6]]
>>> test[:]
[[1, 2], [3, 5], [5, 6]]


#id 값이 달라졌다.
>>> import copy #라이브러리
>>> test
[[1, 2], [3, 5], [5, 6]]
>>> test2=copy.deepcopy(test)
>>> test
[[1, 2], [3, 5], [5, 6]]
>>> test2
[[1, 2], [3, 5], [5, 6]]
>>> id(test)
2684204517640
>>> id(test2)
2684201817608

#==============================================================================
import copy
stu_i=[]

while(True):
    print("1. 학생등록 \n2.학생 점수 등록\n3.학생 정보출력\n4.학생순위순 표기\n5.종료")
    sel = int(input())
    if(sel==1):
        name = input("학생의 이름을 등록하세요~!!!")
        age = input("학생의 나이를 입력하세요~!!!")
        stu_i.append([name,age,0])
    elif(sel==2):
        n= int(input("등록하고자 하는 학생 번호 입력: "))
        sc = int(input("점수를 등록하세요~!!!"))
        stu_i[n][2] = sc
    elif(sel==3):
        n= int(input("확인하고자 하는 학생 번호 입력:"))
        print("%s번 학생 | 이름 : %s |나이: %s|점수: %s"%(n.stu_i[n][0],n.stu_i[n][1],n.stu_i[n][2]))
    elif(sel==4):
        print("학생 순위순 표기")
        tmp = copy.deepcopy(stu_i)
        l= len(tmp)
        for i in range(len(stu_i)-1):
            for j in range(i+1,l):
                if(tmp[i][2]<tmp[j][2]):#정순 정렬
                    tmp[i],tmp[j] = tmp[j],tmp[i]
        print(tmp)  
    else:
        break;
























